[net]
channels=3

[convolutional]
filters=32
size=3
stride=2
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=32
size=3
stride=1
pad=1
padding=0
groups=32
activation=relu6
batch_normalize=1

[convolutional]
filters=16
size=1
stride=1
pad=1
padding=0
groups=1
activation=linear
batch_normalize=1

[convolutional]
filters=88
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=88
size=3
stride=2
pad=1
padding=0
groups=88
activation=relu6
batch_normalize=1

[convolutional]
filters=24
size=1
stride=1
pad=1
padding=0
groups=1
activation=linear
batch_normalize=1

[convolutional]
filters=120
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=120
size=3
stride=1
pad=1
padding=0
groups=120
activation=relu6
batch_normalize=1

[convolutional]
filters=24
size=1
stride=1
pad=1
padding=0
groups=1
activation=linear
batch_normalize=1

[shortcut]
activation=linear
alpha=1
beta=1
from=-4

[convolutional]
filters=120
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=120
size=3
stride=2
pad=1
padding=0
groups=120
activation=relu6
batch_normalize=1

[convolutional]
filters=32
size=1
stride=1
pad=1
padding=0
groups=1
activation=linear
batch_normalize=1

[convolutional]
filters=128
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=128
size=3
stride=1
pad=1
padding=0
groups=128
activation=relu6
batch_normalize=1

[convolutional]
filters=32
size=1
stride=1
pad=1
padding=0
groups=1
activation=linear
batch_normalize=1

[shortcut]
activation=linear
alpha=1
beta=1
from=-4

[convolutional]
filters=120
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=120
size=3
stride=1
pad=1
padding=0
groups=120
activation=relu6
batch_normalize=1

[convolutional]
filters=32
size=1
stride=1
pad=1
padding=0
groups=1
activation=linear
batch_normalize=1

[shortcut]
activation=linear
alpha=1
beta=1
from=-4

[convolutional]
filters=168
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=168
size=3
stride=2
pad=1
padding=0
groups=168
activation=relu6
batch_normalize=1

[convolutional]
filters=64
size=1
stride=1
pad=1
padding=0
groups=1
activation=linear
batch_normalize=1

[convolutional]
filters=128
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=128
size=3
stride=1
pad=1
padding=0
groups=128
activation=relu6
batch_normalize=1

[convolutional]
filters=64
size=1
stride=1
pad=1
padding=0
groups=1
activation=linear
batch_normalize=1

[shortcut]
activation=linear
alpha=1
beta=1
from=-4

[convolutional]
filters=72
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=72
size=3
stride=1
pad=1
padding=0
groups=72
activation=relu6
batch_normalize=1

[convolutional]
filters=64
size=1
stride=1
pad=1
padding=0
groups=1
activation=linear
batch_normalize=1

[shortcut]
activation=linear
alpha=1
beta=1
from=-4

[convolutional]
filters=88
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=88
size=3
stride=1
pad=1
padding=0
groups=88
activation=relu6
batch_normalize=1

[convolutional]
filters=64
size=1
stride=1
pad=1
padding=0
groups=1
activation=linear
batch_normalize=1

[shortcut]
activation=linear
alpha=1
beta=1
from=-4

[convolutional]
filters=296
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=296
size=3
stride=1
pad=1
padding=0
groups=296
activation=relu6
batch_normalize=1

[convolutional]
filters=96
size=1
stride=1
pad=1
padding=0
groups=1
activation=linear
batch_normalize=1

[convolutional]
filters=224
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=224
size=3
stride=1
pad=1
padding=0
groups=224
activation=relu6
batch_normalize=1

[convolutional]
filters=96
size=1
stride=1
pad=1
padding=0
groups=1
activation=linear
batch_normalize=1

[shortcut]
activation=linear
alpha=1
beta=1
from=-4

[convolutional]
filters=208
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=208
size=3
stride=1
pad=1
padding=0
groups=208
activation=relu6
batch_normalize=1

[convolutional]
filters=96
size=1
stride=1
pad=1
padding=0
groups=1
activation=linear
batch_normalize=1

[shortcut]
activation=linear
alpha=1
beta=1
from=-4

[convolutional]
filters=320
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=320
size=3
stride=2
pad=1
padding=0
groups=320
activation=relu6
batch_normalize=1

[convolutional]
filters=160
size=1
stride=1
pad=1
padding=0
groups=1
activation=linear
batch_normalize=1

[convolutional]
filters=168
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=168
size=3
stride=1
pad=1
padding=0
groups=168
activation=relu6
batch_normalize=1

[convolutional]
filters=160
size=1
stride=1
pad=1
padding=0
groups=1
activation=linear
batch_normalize=1

[shortcut]
activation=linear
alpha=1
beta=1
from=-4

[convolutional]
filters=128
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=128
size=3
stride=1
pad=1
padding=0
groups=128
activation=relu6
batch_normalize=1

[convolutional]
filters=160
size=1
stride=1
pad=1
padding=0
groups=1
activation=linear
batch_normalize=1

[shortcut]
activation=linear
alpha=1
beta=1
from=-4

[convolutional]
filters=264
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=264
size=3
stride=1
pad=1
padding=0
groups=264
activation=relu6
batch_normalize=1

[convolutional]
filters=320
size=1
stride=1
pad=1
padding=0
groups=1
activation=linear
batch_normalize=1

[convolutional]
filters=328
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=192
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=192
size=3
stride=1
pad=1
padding=0
groups=192
activation=relu6
batch_normalize=1

[convolutional]
filters=408
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=200
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=200
size=3
stride=1
pad=1
padding=0
groups=200
activation=relu6
batch_normalize=1

[convolutional]
filters=376
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=192
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=192
size=3
stride=1
pad=1
padding=0
groups=192
activation=relu6
batch_normalize=1

[convolutional]
filters=200
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=75
size=1
stride=1
pad=1
padding=0
groups=1
activation=linear
batch_normalize=0

[yolo]
classes=20
ignore_thresh=0.5
bbox_loss=giou
l1_loss_gain=0.05
anchors=116, 90, 156, 198, 373, 326

[route]
layers=-5

[convolutional]
filters=96
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[upsample]
stride=2

[route]
layers=-1, 46

[convolutional]
filters=112
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=112
size=3
stride=1
pad=1
padding=0
groups=112
activation=relu6
batch_normalize=1

[convolutional]
filters=200
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=88
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=88
size=3
stride=1
pad=1
padding=0
groups=88
activation=relu6
batch_normalize=1

[convolutional]
filters=144
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=96
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=96
size=3
stride=1
pad=1
padding=0
groups=96
activation=relu6
batch_normalize=1

[convolutional]
filters=160
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=75
size=1
stride=1
pad=1
padding=0
groups=1
activation=linear
batch_normalize=0

[yolo]
classes=20
ignore_thresh=0.5
bbox_loss=giou
l1_loss_gain=0.05
anchors=30, 61, 62, 45, 59, 119

[route]
layers=-5

[convolutional]
filters=32
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[upsample]
stride=2

[route]
layers=-1, 20

[convolutional]
filters=40
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=40
size=3
stride=1
pad=1
padding=0
groups=40
activation=relu6
batch_normalize=1

[convolutional]
filters=56
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=32
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=32
size=3
stride=1
pad=1
padding=0
groups=32
activation=relu6
batch_normalize=1

[convolutional]
filters=48
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=32
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=32
size=3
stride=1
pad=1
padding=0
groups=32
activation=relu6
batch_normalize=1

[convolutional]
filters=88
size=1
stride=1
pad=1
padding=0
groups=1
activation=relu6
batch_normalize=1

[convolutional]
filters=75
size=1
stride=1
pad=1
padding=0
groups=1
activation=linear
batch_normalize=0

[yolo]
classes=20
ignore_thresh=0.5
bbox_loss=giou
l1_loss_gain=0.05
anchors=10, 13, 16, 30, 33, 23